#+PROPERTY: header-args :results output :results silent :session *julia* :noweb yes
#+OPTIONS: title:nil author:nil date:nil toc:nil
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [12pt]
#+LATEX_HEADER_EXTRA: \input{\string~/Dropbox/Tex/standard_preamble.tex}
#+AUTHOR: Graham Smith
#+EMAIL: grahams@uchicago.edu
#+TITLE: Numerically Solving the Wilson-Cowan Integro-Differential Equation
#+LATEX_HEADER: \input{\string~/Dropbox/Tex/math_preamble.tex}


** Parameter file reading
Because I originally wrote this in Python, the parameter files are JSON. (In the
process of moving to fully Julia parameters).
#+BEGIN_SRC julia :noweb-ref parameters-loader :results silent
  function convert_py(val::Number)
      float(val)
  end

  function convert_py(a::T) where T <: Array
      if a[1] isa Array && a[1][1] isa Number # eltype gives Any, for some reason
          return InteractionParam(vcat([convert_py(arr) for arr in a]...))
      elseif a[1] isa Dict
          return convert_py.(a)
      elseif a[1] isa Number
          return PopulationParam(convert_py.(vcat(a...))) # Python arrays are rows...
      else
          error("Unsupported parse input array of eltype $(typeof(a[1]))")
      end
  end

  convert_py(val::String) = val

  function convert_py(d::T) where T <: Dict
      # TODO: Find package that does this...
      unicode_dct = Dict(:alpha=>:α, :beta=>:β, :tau=>:τ, :theta=>:θ)
      function convert_pykey(k_sym::Symbol)
          if k_sym in keys(unicode_dct)
              return unicode_dct[k_sym]
          else
              return k_sym
          end
      end
      convert_pykey(k::String) = (convert_pykey ∘ Symbol)(k)

      return Dict(convert_pykey(k) => convert_py(v) for (k,v) in d)
  end

  function deep_merge(dct1, dct2::D) where D <: Dict
      new_dct = deepcopy(dct1)
      for k in keys(dct2)
          if k in keys(dct1)
              new_dct[k] = deep_merge(dct1[k], dct2[k])
          else
              new_dct[k] = dct2[k]
          end
      end
      return new_dct
  end
  function deep_merge(el1, el2)
      return el2
  end
  function deep_merge(el1, void::Void)
      return el1
  end
  function load_WilsonCowan73_parameters(json_filename::String, modifications=nothing)
      # Parse JSON with keys as symbols.
      param_dct = (convert_py ∘ JSON.parsefile)(json_filename)
      return deep_merge(param_dct, modifications)
  end

#+END_SRC

#+RESULTS:
#+begin_example
convert_py (generic function with 1 method)

parse_pykey (generic function with 1 method)

parse_pyvalue (generic function with 1 method)

parse_pyarray (generic function with 1 method)

parse_py_dict (generic function with 1 method)

load_WilsonCowan73_parameters (generic function with 1 method)
#+end_example

